Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/udir.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: use various aesthetic forms of expression in composite texts
nn: bruke ulike estetiske uttrykksformer i samansette tekstar

source: This shall give the individual insight into on how society in general influences attitudes, knowledge and actions and how the individual can influence society and his or her own life situation.
nn: Det skal gjere individet medvite om korleis det sosiale fellesskapet påverkar haldningar, kunnskapar og handlingar, og korleis den einskilde kan påverke fellesskapet og sin eigen livssituasjon.

source: music and children’s literature, represent the numbers in different ways and switch between the different representations
nn: barnelitteratur, representere tala på ulike måtar og omsetje mellom dei ulike representasjonane

source: For the half-year assessment, the teacher shall award one grade in oral Norwegian and one in written Norwegian.
nn: I halvårsvurderinga skal læraren gi éin karakter i norsk munnleg og éin i norsk skriftleg.

source: It was the kindergarten teachers who were in charge of implementing the scheme set up by the researchers.
nn: Det var barnehagelærarane som var ­ansvarlege for å gjennomføre ­opplegget som forskarane hadde laga.

source: This main subject area provides an overview of the location and extent of natural and man-made conditions on earth.
nn: Hovudområdet gjev oversikt over lokalisering og utbreiing av naturlege og menneskeskapte forhold på jorda.

source: Law and justice is one of the building blocks in a democratic society.
nn: Lov og rett er ein av byggjesteinane i eit demokratisk samfunn.

source: Numbers include integers, fractions, decimal numbers and percentages.
nn: Tal omfattar både heile tal, brøk, desimaltal og prosent.

source: and through creative activities develop the ability to express themselves in different ways,
nn: om og gjennom skapande verksemd, utviklar evna til å uttrykkje seg på ulike måtar og til å

source: accurately convey technical information using digital media and tools
nn: formidle faginnhald presist og bruke digitale medium og verktøy i formidlinga

source: By working with the democracy and citizenship topic the pupils shall develop an
nn: Gjennom arbeid med temaet demokrati og medborgarskap skal elevane forstå

source: They compare and measure and play around with what are, in fact, mathematical concepts.
nn: Dei samanliknar og måler og leiker på den måten med det som faktisk er matematiske omgrep.

source: The other focuses on the use of vectors and coordinates to convert geometrical problems to algebra.
nn: I skolearbeidet utnyttar ein sentrale idear, former, strukturar og samanhengar i faget.

source: The pupils demonstrate and develop competence in the subject in year 10 when they formalise thoughts and strategies using mathematical language.
nn: Elevane viser og utviklar kompetanse i faget på 10. trinn når dei formaliserer tankar og strategiar ved hjelp av eit matematisk språk.

source: Mathematics is an underpinning of important elements of our cultural history and for the development of logical thinking.
nn: Matematikk ligg til grunn for viktige delar av kulturhistoria vår og for utviklinga av logisk tenking.

source: use a variety of digital search strategies to find and compare information that describes problems from different points of view and evaluate the objectives and relevance of one’s sources
nn: bruke varierte digitale søkjestrategiar for å finne og samanlikne informasjon som beskriv problemstillingar frå ulike synsvinklar, og vurdere formålet og relevansen til kjeldene

source: The social studies subject shall develop knowledge on working life and economics.
nn: Samfunnsfaget skal og utvikle kunnskap om arbeidsliv og økonomi.

source: in Law involves using calculations in solving problems, for example in connection with inheritance settlements and the division of estate in separation and divorce cases.
nn: i rettslære inneber å løyse oppgåver med utrekningar, til dømes i samband med arveoppgjer og deling av formue ved separasjon og skilsmisse.

source: explore geometric figures and patterns
nn: utforske geometriske figurar og mønster

source: discuss randomness and probability in games and practical situations
nn: diskutere tilfeldigheit og sannsyn i spel og praktiske situasjonar og

source: inform others about how food habits may influence lifestyle- and diet-related illnesses
nn: informere andre om korleis matvanar kan påverke sjukdommar som heng saman med livsstil og kosthald

source: Formative assessment shall help to promote learning and develop competence in the mathematics subject.
nn: Undervegsvurderinga skal bidra til å fremje læring og til å utvikle kompetanse i matematikk.

source: explore multiplication by counting experiment with multiplication and division in everyday situations represent multiplication in different ways and switch between the
nn: utforske multiplikasjon ved teljing eksperimentere med multiplikasjon og divisjon i kvardagssituasjonar representere multiplikasjon på ulike måtar og omsetje mellom dei ulike

source: There are two subject curricula for this subject.
nn: Det er to variantar av læreplanen i faget.

source: Sociology and economics are integrated in each main subject area.
nn: Samfunnskunnskap og økonomi blir integrerte i kvart hovudområde.

source: What if we allow body and mind to be two aspects of the same learning process?’
nn: Kva om vi lèt både kropp og sinn vere involverte i læringsprosessen?

source: This topic shall help the pupils learn
nn: Temaet skal bidra til at elevane lærer å handtere

source: explain the argumentation employed in non-fiction texts by applying their knowledge of rhetoric
nn: forklare argumentasjonen i sakprosatekstar ved å bruke kunnskap om retorikk

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence in exploring different representations and problem solving strategies and arguing using mathematical terminology.
nn: Læraren skal gi rettleiing om vidare læring og tilpasse opplæringa slik at elevane kan bruke rettleiinga for å utvikle kompetansen sin i å utforske ulike representasjonar og problemløysingsstrategiar og i å argumentere med matematiske omgrep.

source: The subject has been organized into main areas for which competence aims have been formulated.
nn: Faget er strukturert i hovudområde som det er formulert kompetansemål for.

source: present day and assess its significance for how people have perceived themselves and others
nn: vår tid, og vurdere kva han har betydd for korleis folk har oppfatta seg sjølve og andre

source: discuss content and form in composite texts
nn: samtale om innhald og form i samansette tekstar

source: recognise characteristics of the Norwegian language forms Bokmål and Nynorsk
nn: vurdere tekstar med utgangspunkt i eigne opplevingar og med forståing av språk og innhald

source: write subject-related articles that explain and discuss texts in context
nn: skrive fagartiklar som gjer greie for og drøftar tekstar i kontekst

source: feedback and knowledge about language, text and genres to
nn: tilbakemeldingar og kunnskap om språk, tekst og sjanger til å

source: The subject shall also give insight into how natural resources, weather and climate have provided the basis for the settlement and development of communities.
nn: Faget skal gje innsikt i korleis naturressursar, vêr og klima har lagt mykje av grunnlaget for busetnad og utvikling av samfunn.

source: Physical activity is important for everyone as this fosters good health.
nn: Fysisk aktivitet for alle i oppveksten er òg viktig for å fremje god helse.

source: explain why culture is not inherent, and explain and analyse cultural variations
nn: forklare kvifor kultur ikkje er medfødd, og gjere greie for og analysere kulturelle variasjonar

source: The pupils demonstrate and develop competence in the subject in year 5 when exploring and reflecting on different mathematical concepts, representations and strategies when working with fractions and informal solving of equations and inequalities.
nn: Elevane viser og utviklar kompetanse i faget på 5. trinn når dei utforskar og reflekterer over ulike matematiske omgrep, representasjonar og strategiar i arbeid med brøk og uformell løysing av likningar og ulikskapar.

source: explore sources and use them to make copies of artefacts from the past
nn: utforske kjelder og bruke dei til å lage etterlikningar av gjenstandar frå fortida

source: It also involves using presentation tools.
nn: Det inneber òg å kunne bruke presentasjonsverktøy.

source: discuss the relationship between systems of government, a state governed by law and human rights
nn: diskutere samanhengar mellom styreform, rettsstat og menneskerettar

source: Democracy and citizenship as an interdisciplinary topic in school shall give the pupils
nn: Demokrati og medborgarskap som tverrfagleg tema i skolen skal gi elevane kunnskap om

source: pupils must learn and develop through sensory perceptions and thinking, aesthetic forms of
nn: Elevane skal lære og utvikle seg gjennom sansing og tenking,

source: Medium, individual and society
nn: Medium, individ og samfunn

source: It is important to have a holistic- Sami perspective and an indigenous-people's perspective in the Sami school, and to focus on material and immaterial cultural heritage, such as traditional knowledge, duodji/duodje/duedtie and the importance of familial relations.
nn: I samisk skole er det viktig å ha eit allsamisk perspektiv og eit urfolksperspektiv og å leggje vekt på materiell og immateriell kulturarv som tradisjonell kunnskap, duodji/duodje/duedtie og slekts- og familierelasjonar.

source: Pupils must understand where we can find
nn: Dei skal forstå korleis vi gjennom kunnskap og samarbeid kan finne

source: extract and interpret relevant information from texts relating to
nn: hente ut og tolke relevant informasjon frå tekstar om kjøp og sal og

source: assess the use of aesthetic techniques in various media
nn: uttrykkje seg med eit presist og nyansert ordforråd og meistre språklege formkrav

source: use various aids critically and independently
nn: symje på magen og på ryggen og dukke

source: She points out that earlier studies conducted by the National Council for Children have shown a close link between well-being and doing well at school.
nn: Ho peikar på at Børnerådet frå tidlegare undersøkingar veit at det er ei tett kopling mellom trivsel og fagkunne i skolen.

source: The teacher and pupils shall engage in dialogue about their development in mathematics.
nn: Læraren skal vere i dialog med elevane om utviklinga deira i matematikk.

source: As a practical subject, the teaching in food and health shall stimulate the pupils to prepare food and instil in them the joy of working and good working habits, as well as shall show them how to be discerning consumers so they can assume responsibility for food and meals at home and in their leisure time, and in working and social life.
nn: Som praktisk fag skal opplæringa i mat og helse stimulere elevane til å lage mat og skape arbeidsglede og gode arbeidsvanar, og til å bli medvitne forbrukarar, slik at dei kan ta ansvar for mat og måltid, både i heim og fritid og i arbeidsliv og samfunnsliv.

source: write essays that explore and reflect on the content of texts
nn: skrive essay som utforskar og reflekterer over innhald i tekstar

source: Development, construction and production of technology are included in the main subject area, in addition to Environment, Health and Safety (EHS).
nn: I tillegg viser og utviklar dei kompetanse ved å bruke verktøy og ved å reflektere over og grunngi val og framgangsmåtar.

source: This also has linguistic aspects, such as reasoning, communicating converse about and applying reason to ideas.
nn: Dette har òg språklege aspekt, som det å resonnere og kommunisere idear.

source: carry out experiments with electrochemical cells and give an account of spontaneous and non-spontaneous redox reactions
nn: forklare kva redoksreaksjonar er, gjere forsøk med forbrenning, galvanisk element og elektrolyse, og gjere greie for resultata

source: It also involves the ability to read instruction guidelines, surveys, models and theories.
nn: Det tyder òg å lese bruksrettleiingar, undersøkingar, modellar og teoriar.

source: Much of the time the employees work together.”
nn: Noen blikk i Utdanningsspeilet utdjupar i år to hovudtema.

source: Differentiated instruction applies to all pupils and shall for the most part take place through
nn: Tilpassa opplæring gjeld alle elevar og skal i størst mogleg grad skje gjennom variasjon og

source: They also demonstrate and develop their competence in mathematics when they have a sense of wonder, ask mathematical questions, test and use mathematical concepts and explain and argue for their own solutions.
nn: Vidare viser og utviklar dei kompetanse i matematikk når dei undrar seg, stiller matematiske spørsmål, testar og bruker matematiske omgrep og forklarer og argumenterer for eigne løysingar.

source: describe equality and inequality in comparing sizes, amounts,
nn: beskrive likskap og ulikskap i samanlikning av storleikar, mengder,

source: describe the significance of religion for society and power structures
nn: vurdere korleis mennesket har forhalde seg til naturen, forvalta og

source: The grade awarded for coursework shall reflect the overall competence of the pupil in Social Studies after completing year 10.
nn: Standpunktkarakteren skal vere uttrykk for den samla kompetansen eleven har i samfunnsfag ved avslutninga av opplæringa etter 10.

source: Digital skills also means being knowledgeable about privacy protection and copyrights, and being able to use and comply with rules and norms that apply to internet-based communication.
nn: Digitale ferdigheiter vil òg seie å vere orientert om personvern og opphavsrett, og kunne bruke og følgje reglar og normer som gjeld for internettbasert kommunikasjon.

source: exploit and assess various situations, working methods and strategies for learning English
nn: planleggje og gjennomføre oppvarming i samband med ulike treningsaktivitetar

source: The pupils also demonstrate and develop competence when they use knowledge about the language as a system to develop their own texts and to compare languages.
nn: Elevane viser og utviklar òg kompetanse når dei bruker kunnskap om språket som system til å utvikle eigne tekstar og til å samanlikne språk.

source: use this in one’s own mental arithmetic and problem solving
nn: bruke det i hovudrekning og problemløysing

source: However, that is not enough for everyone”, observes researcher Kathrine Bjørgen.
nn: Men dette er ikkje nok for alle, meiner forskar Kathrine Bjørgen.

source: A total of 18 children, ages one and two, from nine different ECEC facilities, were observed for one hour each.
nn: I alt 18 barn på eitt og to år, i ni ulike barnehagar, vart observerte i éin time kvar.

source: Many applied their intuition as educators and had made ethical reflections regarding the use of digital photos, games and the Internet.
nn: Mange brukte sitt pedagogiske skjønn og gjorde etiske refleksjonar omkring bruken av digitale foto, spel og internett.

source: these changes and their impact on people and society
nn: brukt naturressursar, og vurdere kva dette har betydd for folk og eit berekraftig samfunn

source: in social studies means telling other about events in the past and the present, explaining about places and facts and applying definitions, concepts and terms to explain causes and effects in connection with society and culture.
nn: i samfunnsfag inneber å fortelje om hendingar i fortida og samtida, å greie ut om stader og fakta og å bruke definisjonar, omgrep og faguttrykk til å forklare årsaker og verknader knytte til samfunn og kultur.

source: give examples of various ways of learning English words and expressions
nn: utføre varierte aktivitetar som byggjer opp kroppen på ulike måtar

source: The grade awarded for coursework shall reflect the overall competence of the pupil in natural science after completing Year 10.
nn: Standpunktkarakteren skal vere uttrykk for den samla kompetansen eleven har vist i naturfag ved avsluttinga av opplæringa etter 10.

source: Some post those pictures on Facebook.
nn: Somme legg dei ut på Facebook.

source: represent division in different ways and switch between the different
nn: representere divisjon på ulike måtar og omsetje mellom dei ulike

source: use digital tools to collect information on numerous professions and discuss opportunities and challenges in the labour market today
nn: finne informasjon om ulike yrke og diskutere moglegheiter og utfordringar på arbeidsmarknaden i dag

source: use digital sources and tools to create composite texts with hyperlinks and a variety of aesthetic devices
nn: bruke digitale kjelder og verktøy til å lage samansette tekstar med hyperkoplingar og varierte estetiske verkemiddel

source: give an account of the main principles of legal method
nn: gjere greie for hovudprinsippa i juridisk metode

source: Teaching periods are given in 60-minute units:
nn: Timetala er oppgjevne i einingar på 60 minutt:

source: Researcher Mette Løvgren conducted a survey of 2500 employees of 588 Norwegian kindergartens in an effort to discover something that few other kindergarten researchers have seen earlier.
nn: Forskar Mette Løvgren har i ein studie snakka med 2500 tilsette i 588 norske barnehagar og har bidrege til å avdekkje noko få andre barnehageforskarar har sett tidlegare.

source: They also demonstrate and develop competence when they explore, argue, analyse and reflect on natural-science topics and the interconnections between them, and assess their findings and results.
nn: Dei viser og utviklar òg kompetanse når dei utforskar, argumenterer, analyserer og reflekterer over naturfaglege emne og samanhengar mellom dei, og vurderer eigne funn og resultat.

source: It focuses on the organisations in working life and how wages are set.
nn: Det dreier seg og om organisasjonane i arbeidslivet og lønnsdanning.

source: sit and draw, following along with each others’ work.
nn: sit og teiknar og følgjer arbeidet til kvarandre.

source: on equalities and inequalities in cultural expression, identity and lifestyles within and between the majority and minority groups in Norway and the Sápmi/Sábme/Sáepmie
nn: over likskapar og ulikskapar i kulturuttrykk, identitet og levesett innanfor og mellom majoritet og minoritet i Noreg og Sápmi/Sábme/Sáepmie

source: Oral skills in the food and health subject are also connected to explaining practical problems and formulating questions, and to arguing and communicating ideas in the subject in conversations with others.
nn: Munnlege ferdigheiter i faget mat og helse er knytte til det å gjere greie for praktiske problem og formulere spørsmål, og til det å argumentere og kommunisere idear i faget i samtale med andre.

source: This means that children and adults alike lose out on important experiences', comments researcher Lone Svinth.
nn: Det gjer at både barn og vaksne går glipp av viktige erfaringar, lyder det frå forskar Lone Svinth.

source: duodji/duodje/duedtie and the importance of familial relations.
nn: tradisjonell kunnskap, duodji/duodje/duedtie og slekts- og familierelasjonar.

source: It also involves learning how to use and assess digital aids and tools for calculating, problem solving, simulation and modelling.
nn: Det handlar òg om å kjenne til, bruke og vurdere digitale hjelpemiddel til problemløysing, simulering og modellering.

source: work with measures and weights in connection with recipes and preparing food
nn: bruke mål og vekt i samband med oppskrifter og matlaging

source: With numbers it is possible to quantify amounts and sizes.
nn: Med tal kan ein kvantifisere mengder og storleikar.

source: This involves being able to present impressions from and perceptions of various physical activities.
nn: Å kunne uttrykkje seg munnleg i kroppsøving handlar mellom anna om å kunne formidle inntrykk og opplevingar frå ulike aktivitetar.

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics and solve mathematical problems by being creative, and by reasoning and reflecting.
nn: Læraren skal leggje til rette for elevmedverknad og stimulere til lærelyst ved at elevane får utforske matematikk og løyse matematiske problem gjennom å vere kreative, resonnere og reflektere.

source: give an account of and comply with current legislation related to occupational therapy related to environment, health and safety
nn: gjere greie for og følgje gjeldande regelverk knytt til aktivitørfaget i tråd med kvalitetssikring, helse, miljø og sikkerheit

source: Geography - common core subject in programmes for general studies (GEO1-01)
nn: Læreplan i geografi - fellesfag i studieførebuande utdanningsprogram (GEO1-01)

source: prepare food from different cultures
nn: lage mat frå ulike kulturar

source: use variables and formulas to express relationships in practical
nn: bruke variablar og formlar til å uttrykkje samanhengar i praktiske

source: Björklund and Barendregt also find reason for optimism about the results of the study.
nn: Björklund og Barendregt finn òg grunn til optimisme i resultata frå studien.

source: collaboration with the pupils.
nn: omsorgsfulle vaksne, i samarbeid med elevane.

source: express and justify own views while respecting the views of others
nn: uttrykkje og grunngje eigne standpunkt og vise respekt for det andre meiner

source: Competence is the ability to acquire and apply knowledge and skills to masterchallenges and solve tasks in familiar and unfamiliar contexts and situations.
nn: Kompetanse er å kunne tileigne seg og nytte kunnskapar og ferdigheiter til åmeistre utfordringar og løyse oppgåver i kjende og ukjende samanhengar ogsituasjonar.

source: Principles for the school's practice
nn: Prinsipp for praksisen i skolen

source: Freedom of expression and the role of the press in the growth of democracy are key aspects of the main subject area.
nn: Ytringsfridom og pressa si rolle i utviklinga av demokratiet står sentralt i hovudområdet.

source: measure and compare the measurement units of length and area,
nn: måle og samanlikne storleikar som gjeld lengd og areal, ved hjelp av

source: Evaluating measurement results and deliberating measurement uncertainty are important elements of the process.
nn: Vurdering av resultatet og drøfting av måleusikkerheit er viktige delar av måleprosessen.

source: make arithmetic expressions for use in practical situations and find
nn: lage rekneuttrykk til praktiske situasjonar og finne praktiske situasjonar

source: calculate and assess probability in statistics and games simulate outcomes in random trials and calculate the probability that
nn: berekne og vurdere sannsyn i statistikk og spel simulere utfall i tilfeldige forsøk og berekne sannsynet for at noko skal

source: Geography shall provide the basis for understanding population development and the distribution of resources, explaining similarities and differences and discussing change processes.
nn: Geografi skal gje grunnlag for å forstå befolkningsutvikling, kartleggje fordeling av ressursar, forklare likskapar og ulikskapar og diskutere endringsprosessar.

source: At the same moment a kindergarten teacher passes by.
nn: I det same kjem ein av barnehagelærarane forbi.

source: Are they from popular culture?
nn: Er det frå populærkulturen?
